Revit 2027 API
UIMacroManager Methods
The UIMacroManager type exposes the following members.
Methods
Name | Description
AddModule |  Adds a MacroModule to the application.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMacroManager |  Gets the UI Macro manager from the UI application.
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveModule |  Removes a MacroModule.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace